tpo/lab4/results/stress/jmeter_tp1000.log
2026-05-30 21:45:03,574 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-30 21:45:03,597 INFO o.a.j.JMeter: Loading user properties from: /home/studs/s413122/apache-jmeter-5.6.3/bin/user.properties
2026-05-30 21:45:03,597 INFO o.a.j.JMeter: Loading system properties from: /home/studs/s413122/apache-jmeter-5.6.3/bin/system.properties
2026-05-30 21:45:03,598 INFO o.a.j.JMeter: Setting JMeter property: config=2
2026-05-30 21:45:03,598 INFO o.a.j.JMeter: Setting JMeter property: throughput=1000
2026-05-30 21:45:03,598 INFO o.a.j.JMeter: Setting JMeter property: threads=45
2026-05-30 21:45:03,598 INFO o.a.j.JMeter: Setting JMeter property: duration=75
2026-05-30 21:45:03,598 INFO o.a.j.JMeter: Setting JMeter property: rampup=10
2026-05-30 21:45:03,605 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-30 21:45:03,605 INFO o.a.j.JMeter: Version 5.6.3
2026-05-30 21:45:03,605 INFO o.a.j.JMeter: java.version=17.0.12
2026-05-30 21:45:03,605 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-30 21:45:03,605 INFO o.a.j.JMeter: os.name=FreeBSD
2026-05-30 21:45:03,606 INFO o.a.j.JMeter: os.arch=amd64
2026-05-30 21:45:03,606 INFO o.a.j.JMeter: os.version=14.4-STABLE
2026-05-30 21:45:03,606 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-05-30 21:45:03,606 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-30 21:45:03,606 INFO o.a.j.JMeter: Max memory     =2147483648
2026-05-30 21:45:03,606 INFO o.a.j.JMeter: Available Processors =16
2026-05-30 21:45:03,616 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-30 21:45:03,616 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-30 21:45:03,616 INFO o.a.j.JMeter: JMeterHome=/home/studs/s413122/apache-jmeter-5.6.3
2026-05-30 21:45:03,617 INFO o.a.j.JMeter: user.dir  =/home/studs/s413122/lab4
2026-05-30 21:45:03,617 INFO o.a.j.JMeter: PWD       =/home/studs/s413122/lab4
2026-05-30 21:45:03,624 INFO o.a.j.JMeter: IP: 192.168.10.80 Name: helios.cs.ifmo.ru FullName: helios.cs.ifmo.ru
2026-05-30 21:45:03,643 INFO o.a.j.s.FileServer: Default base='/home/studs/s413122/lab4'
2026-05-30 21:45:03,645 INFO o.a.j.s.FileServer: Set new base='/home/studs/s413122/lab4'
2026-05-30 21:45:03,835 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-30 21:45:03,862 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-30 21:45:03,866 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-30 21:45:03,869 INFO o.a.j.s.SaveService: Loading file: /home/studs/s413122/lab4/load-test.jmx
2026-05-30 21:45:03,931 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:45:03,931 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:45:03,931 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:45:03,931 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:45:03,931 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-30 21:45:03,931 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-30 21:45:03,964 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-30 21:45:03,984 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-30 21:45:03,985 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-30 21:45:03,985 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-30 21:45:03,990 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-30 21:45:03,990 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-30 21:45:04,055 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-cmd-2.3.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:45:04,059 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-manager-1.10.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:45:04,150 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-cmn-jmeter-0.8.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:45:04,175 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-graphs-vs-2.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:45:04,176 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-graphs-basic-2.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:45:04,194 INFO o.a.j.JMeter: Running test (1780166704194)
2026-05-30 21:45:04,212 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users
2026-05-30 21:45:04,213 INFO o.a.j.e.StandardJMeterEngine: Starting 45 threads for group Users.
2026-05-30 21:45:04,213 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-30 21:45:04,213 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=45 ramp-up=10 delayedStart=false
2026-05-30 21:45:04,220 INFO o.a.j.t.JMeterThread: Thread started: Users 1-1
2026-05-30 21:45:04,243 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-30 21:45:04,244 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-30 21:45:04,266 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = helios.cs.ifmo.ru
2026-05-30 21:45:04,273 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-30 21:45:04,274 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-30 21:45:04,274 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-30 21:45:04,274 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-30 21:45:04,274 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-30 21:45:04,437 INFO o.a.j.t.JMeterThread: Thread started: Users 1-2
2026-05-30 21:45:04,659 INFO o.a.j.t.JMeterThread: Thread started: Users 1-3
2026-05-30 21:45:04,880 INFO o.a.j.t.JMeterThread: Thread started: Users 1-4
2026-05-30 21:45:07,132 INFO o.a.j.t.JMeterThread: Thread started: Users 1-13
2026-05-30 21:45:07,132 INFO o.a.j.t.JMeterThread: Thread started: Users 1-14
2026-05-30 21:45:07,132 INFO o.a.j.t.JMeterThread: Thread started: Users 1-7
2026-05-30 21:45:07,132 INFO o.a.j.t.JMeterThread: Thread started: Users 1-9
2026-05-30 21:45:07,132 INFO o.a.j.t.JMeterThread: Thread started: Users 1-6
2026-05-30 21:45:07,132 INFO o.a.j.t.JMeterThread: Thread started: Users 1-11
2026-05-30 21:45:07,132 INFO o.a.j.t.JMeterThread: Thread started: Users 1-8
2026-05-30 21:45:07,132 INFO o.a.j.t.JMeterThread: Thread started: Users 1-10
2026-05-30 21:45:07,132 INFO o.a.j.t.JMeterThread: Thread started: Users 1-12
2026-05-30 21:45:07,132 INFO o.a.j.t.JMeterThread: Thread started: Users 1-5
2026-05-30 21:45:07,323 INFO o.a.j.t.JMeterThread: Thread started: Users 1-15
2026-05-30 21:45:07,545 INFO o.a.j.t.JMeterThread: Thread started: Users 1-16
2026-05-30 21:45:07,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-17
2026-05-30 21:45:07,988 INFO o.a.j.t.JMeterThread: Thread started: Users 1-18
2026-05-30 21:45:08,209 INFO o.a.j.t.JMeterThread: Thread started: Users 1-19
2026-05-30 21:45:08,433 INFO o.a.j.t.JMeterThread: Thread started: Users 1-20
2026-05-30 21:45:08,653 INFO o.a.j.t.JMeterThread: Thread started: Users 1-21
2026-05-30 21:45:08,876 INFO o.a.j.t.JMeterThread: Thread started: Users 1-22
2026-05-30 21:45:09,098 INFO o.a.j.t.JMeterThread: Thread started: Users 1-23
2026-05-30 21:45:09,321 INFO o.a.j.t.JMeterThread: Thread started: Users 1-24
2026-05-30 21:45:09,542 INFO o.a.j.t.JMeterThread: Thread started: Users 1-25
2026-05-30 21:45:09,764 INFO o.a.j.t.JMeterThread: Thread started: Users 1-26
2026-05-30 21:45:09,986 INFO o.a.j.t.JMeterThread: Thread started: Users 1-27
2026-05-30 21:45:10,208 INFO o.a.j.t.JMeterThread: Thread started: Users 1-28
2026-05-30 21:45:10,429 INFO o.a.j.t.JMeterThread: Thread started: Users 1-29
2026-05-30 21:45:10,652 INFO o.a.j.t.JMeterThread: Thread started: Users 1-30
2026-05-30 21:45:10,874 INFO o.a.j.t.JMeterThread: Thread started: Users 1-31
2026-05-30 21:45:11,096 INFO o.a.j.t.JMeterThread: Thread started: Users 1-32
2026-05-30 21:45:11,319 INFO o.a.j.t.JMeterThread: Thread started: Users 1-33
2026-05-30 21:45:11,539 INFO o.a.j.t.JMeterThread: Thread started: Users 1-34
2026-05-30 21:45:11,762 INFO o.a.j.t.JMeterThread: Thread started: Users 1-35
2026-05-30 21:45:11,983 INFO o.a.j.t.JMeterThread: Thread started: Users 1-36
2026-05-30 21:45:12,206 INFO o.a.j.t.JMeterThread: Thread started: Users 1-37
2026-05-30 21:45:12,427 INFO o.a.j.t.JMeterThread: Thread started: Users 1-38
2026-05-30 21:45:12,650 INFO o.a.j.t.JMeterThread: Thread started: Users 1-39
2026-05-30 21:45:12,871 INFO o.a.j.t.JMeterThread: Thread started: Users 1-40
2026-05-30 21:45:13,094 INFO o.a.j.t.JMeterThread: Thread started: Users 1-41
2026-05-30 21:45:13,317 INFO o.a.j.t.JMeterThread: Thread started: Users 1-42
2026-05-30 21:45:13,538 INFO o.a.j.t.JMeterThread: Thread started: Users 1-43
2026-05-30 21:45:13,759 INFO o.a.j.t.JMeterThread: Thread started: Users 1-44
2026-05-30 21:45:13,982 INFO o.a.j.t.JMeterThread: Thread started: Users 1-45
2026-05-30 21:45:30,006 INFO o.a.j.r.Summariser: summary +    386 in 00:00:26 =   15.0/s Avg:   877 Min:   708 Max:  2808 Err:     0 (0.00%) Active: 45 Started: 45 Finished: 0
2026-05-30 21:46:00,053 INFO o.a.j.r.Summariser: summary +    501 in 00:00:30 =   16.7/s Avg:   912 Min:   912 Max:   915 Err:     0 (0.00%) Active: 45 Started: 45 Finished: 0
2026-05-30 21:46:00,054 INFO o.a.j.r.Summariser: summary =    887 in 00:00:56 =   15.9/s Avg:   897 Min:   708 Max:  2808 Err:     0 (0.00%)
2026-05-30 21:46:17,453 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-15
2026-05-30 21:46:17,513 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-26
2026-05-30 21:46:17,573 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-20
2026-05-30 21:46:17,633 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-35
2026-05-30 21:46:17,692 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-16
2026-05-30 21:46:17,753 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-17
2026-05-30 21:46:17,812 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-27
2026-05-30 21:46:17,873 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-36
2026-05-30 21:46:17,932 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-7
2026-05-30 21:46:17,993 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-21
2026-05-30 21:46:18,053 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-8
2026-05-30 21:46:18,112 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-37
2026-05-30 21:46:18,173 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-28
2026-05-30 21:46:18,233 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-5
2026-05-30 21:46:18,292 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-14
2026-05-30 21:46:18,353 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-38
2026-05-30 21:46:18,414 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-12
2026-05-30 21:46:18,474 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-29
2026-05-30 21:46:18,533 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-22
2026-05-30 21:46:18,593 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-39
2026-05-30 21:46:18,653 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-11
2026-05-30 21:46:18,713 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-6
2026-05-30 21:46:18,773 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-30
2026-05-30 21:46:18,834 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-40
2026-05-30 21:46:18,892 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-9
2026-05-30 21:46:18,953 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-23
2026-05-30 21:46:19,012 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-10
2026-05-30 21:46:19,073 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-41
2026-05-30 21:46:19,133 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-31
2026-05-30 21:46:19,192 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-13
2026-05-30 21:46:19,253 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-18
2026-05-30 21:46:19,253 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-18
2026-05-30 21:46:19,312 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-42
2026-05-30 21:46:19,312 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-42
2026-05-30 21:46:19,372 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-24
2026-05-30 21:46:19,372 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-24
2026-05-30 21:46:19,434 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-32
2026-05-30 21:46:19,434 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-32
2026-05-30 21:46:19,494 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-3
2026-05-30 21:46:19,494 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-3
2026-05-30 21:46:19,552 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-43
2026-05-30 21:46:19,552 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-43
2026-05-30 21:46:19,613 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-4
2026-05-30 21:46:19,613 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-4
2026-05-30 21:46:19,674 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-1
2026-05-30 21:46:19,674 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-1
2026-05-30 21:46:19,734 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-33
2026-05-30 21:46:19,734 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-33
2026-05-30 21:46:19,793 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-44
2026-05-30 21:46:19,793 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-44
2026-05-30 21:46:19,853 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-25
2026-05-30 21:46:19,853 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-25
2026-05-30 21:46:19,912 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-19
2026-05-30 21:46:19,913 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-19
2026-05-30 21:46:19,974 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-2
2026-05-30 21:46:19,974 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-2
2026-05-30 21:46:20,033 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-45
2026-05-30 21:46:20,033 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-45
2026-05-30 21:46:20,092 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-34
2026-05-30 21:46:20,092 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-34
2026-05-30 21:46:20,093 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-30 21:46:20,094 INFO o.a.j.r.Summariser: summary +    334 in 00:00:20 =   16.7/s Avg:   912 Min:   912 Max:   920 Err:     0 (0.00%) Active: 0 Started: 45 Finished: 45
2026-05-30 21:46:20,094 INFO o.a.j.r.Summariser: summary =   1221 in 00:01:16 =   16.1/s Avg:   901 Min:   708 Max:  2808 Err:     0 (0.00%)