tpo/lab4/results/stress/jmeter_tp1200.log
2026-05-30 21:46:37,288 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-30 21:46:37,312 INFO o.a.j.JMeter: Loading user properties from: /home/studs/s413122/apache-jmeter-5.6.3/bin/user.properties
2026-05-30 21:46:37,312 INFO o.a.j.JMeter: Loading system properties from: /home/studs/s413122/apache-jmeter-5.6.3/bin/system.properties
2026-05-30 21:46:37,312 INFO o.a.j.JMeter: Setting JMeter property: config=2
2026-05-30 21:46:37,312 INFO o.a.j.JMeter: Setting JMeter property: throughput=1200
2026-05-30 21:46:37,312 INFO o.a.j.JMeter: Setting JMeter property: threads=55
2026-05-30 21:46:37,312 INFO o.a.j.JMeter: Setting JMeter property: duration=75
2026-05-30 21:46:37,313 INFO o.a.j.JMeter: Setting JMeter property: rampup=10
2026-05-30 21:46:37,320 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-30 21:46:37,320 INFO o.a.j.JMeter: Version 5.6.3
2026-05-30 21:46:37,320 INFO o.a.j.JMeter: java.version=17.0.12
2026-05-30 21:46:37,320 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-30 21:46:37,320 INFO o.a.j.JMeter: os.name=FreeBSD
2026-05-30 21:46:37,320 INFO o.a.j.JMeter: os.arch=amd64
2026-05-30 21:46:37,321 INFO o.a.j.JMeter: os.version=14.4-STABLE
2026-05-30 21:46:37,321 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-05-30 21:46:37,321 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-30 21:46:37,321 INFO o.a.j.JMeter: Max memory     =2147483648
2026-05-30 21:46:37,321 INFO o.a.j.JMeter: Available Processors =16
2026-05-30 21:46:37,331 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-30 21:46:37,332 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-30 21:46:37,332 INFO o.a.j.JMeter: JMeterHome=/home/studs/s413122/apache-jmeter-5.6.3
2026-05-30 21:46:37,332 INFO o.a.j.JMeter: user.dir  =/home/studs/s413122/lab4
2026-05-30 21:46:37,332 INFO o.a.j.JMeter: PWD       =/home/studs/s413122/lab4
2026-05-30 21:46:37,340 INFO o.a.j.JMeter: IP: 192.168.10.80 Name: helios.cs.ifmo.ru FullName: helios.cs.ifmo.ru
2026-05-30 21:46:37,355 INFO o.a.j.s.FileServer: Default base='/home/studs/s413122/lab4'
2026-05-30 21:46:37,357 INFO o.a.j.s.FileServer: Set new base='/home/studs/s413122/lab4'
2026-05-30 21:46:37,571 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-30 21:46:37,601 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-30 21:46:37,605 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-30 21:46:37,609 INFO o.a.j.s.SaveService: Loading file: /home/studs/s413122/lab4/load-test.jmx
2026-05-30 21:46:37,675 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:46:37,676 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:46:37,676 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:46:37,676 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:46:37,676 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-30 21:46:37,676 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-30 21:46:37,717 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-30 21:46:37,732 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-30 21:46:37,733 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-30 21:46:37,733 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-30 21:46:37,738 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-30 21:46:37,738 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-30 21:46:37,799 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-cmd-2.3.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:46:37,803 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-manager-1.10.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:46:37,893 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-cmn-jmeter-0.8.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:46:37,918 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-graphs-vs-2.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:46:37,919 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-graphs-basic-2.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:46:37,938 INFO o.a.j.JMeter: Running test (1780166797938)
2026-05-30 21:46:37,955 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users
2026-05-30 21:46:37,956 INFO o.a.j.e.StandardJMeterEngine: Starting 55 threads for group Users.
2026-05-30 21:46:37,956 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-30 21:46:37,956 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=55 ramp-up=10 delayedStart=false
2026-05-30 21:46:37,963 INFO o.a.j.t.JMeterThread: Thread started: Users 1-1
2026-05-30 21:46:37,992 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-30 21:46:37,992 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-30 21:46:38,012 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = helios.cs.ifmo.ru
2026-05-30 21:46:38,018 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-30 21:46:38,020 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-30 21:46:38,020 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-30 21:46:38,020 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-30 21:46:38,020 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-30 21:46:38,141 INFO o.a.j.t.JMeterThread: Thread started: Users 1-2
2026-05-30 21:46:38,322 INFO o.a.j.t.JMeterThread: Thread started: Users 1-3
2026-05-30 21:46:38,504 INFO o.a.j.t.JMeterThread: Thread started: Users 1-4
2026-05-30 21:46:38,686 INFO o.a.j.t.JMeterThread: Thread started: Users 1-5
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-16
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-14
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-10
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-15
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-7
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-8
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-12
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-13
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-6
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-11
2026-05-30 21:46:40,766 INFO o.a.j.t.JMeterThread: Thread started: Users 1-9
2026-05-30 21:46:40,868 INFO o.a.j.t.JMeterThread: Thread started: Users 1-17
2026-05-30 21:46:41,051 INFO o.a.j.t.JMeterThread: Thread started: Users 1-18
2026-05-30 21:46:41,233 INFO o.a.j.t.JMeterThread: Thread started: Users 1-19
2026-05-30 21:46:41,415 INFO o.a.j.t.JMeterThread: Thread started: Users 1-20
2026-05-30 21:46:41,597 INFO o.a.j.t.JMeterThread: Thread started: Users 1-21
2026-05-30 21:46:41,779 INFO o.a.j.t.JMeterThread: Thread started: Users 1-22
2026-05-30 21:46:41,960 INFO o.a.j.t.JMeterThread: Thread started: Users 1-23
2026-05-30 21:46:42,143 INFO o.a.j.t.JMeterThread: Thread started: Users 1-24
2026-05-30 21:46:42,325 INFO o.a.j.t.JMeterThread: Thread started: Users 1-25
2026-05-30 21:46:42,507 INFO o.a.j.t.JMeterThread: Thread started: Users 1-26
2026-05-30 21:46:42,688 INFO o.a.j.t.JMeterThread: Thread started: Users 1-27
2026-05-30 21:46:42,871 INFO o.a.j.t.JMeterThread: Thread started: Users 1-28
2026-05-30 21:46:43,052 INFO o.a.j.t.JMeterThread: Thread started: Users 1-29
2026-05-30 21:46:43,235 INFO o.a.j.t.JMeterThread: Thread started: Users 1-30
2026-05-30 21:46:43,416 INFO o.a.j.t.JMeterThread: Thread started: Users 1-31
2026-05-30 21:46:43,599 INFO o.a.j.t.JMeterThread: Thread started: Users 1-32
2026-05-30 21:46:43,781 INFO o.a.j.t.JMeterThread: Thread started: Users 1-33
2026-05-30 21:46:43,962 INFO o.a.j.t.JMeterThread: Thread started: Users 1-34
2026-05-30 21:46:44,145 INFO o.a.j.t.JMeterThread: Thread started: Users 1-35
2026-05-30 21:46:44,326 INFO o.a.j.t.JMeterThread: Thread started: Users 1-36
2026-05-30 21:46:44,509 INFO o.a.j.t.JMeterThread: Thread started: Users 1-37
2026-05-30 21:46:44,690 INFO o.a.j.t.JMeterThread: Thread started: Users 1-38
2026-05-30 21:46:44,873 INFO o.a.j.t.JMeterThread: Thread started: Users 1-39
2026-05-30 21:46:45,054 INFO o.a.j.t.JMeterThread: Thread started: Users 1-40
2026-05-30 21:46:45,237 INFO o.a.j.t.JMeterThread: Thread started: Users 1-41
2026-05-30 21:46:45,418 INFO o.a.j.t.JMeterThread: Thread started: Users 1-42
2026-05-30 21:46:45,601 INFO o.a.j.t.JMeterThread: Thread started: Users 1-43
2026-05-30 21:46:45,782 INFO o.a.j.t.JMeterThread: Thread started: Users 1-44
2026-05-30 21:46:45,965 INFO o.a.j.t.JMeterThread: Thread started: Users 1-45
2026-05-30 21:46:46,147 INFO o.a.j.t.JMeterThread: Thread started: Users 1-46
2026-05-30 21:46:46,328 INFO o.a.j.t.JMeterThread: Thread started: Users 1-47
2026-05-30 21:46:46,511 INFO o.a.j.t.JMeterThread: Thread started: Users 1-48
2026-05-30 21:46:46,693 INFO o.a.j.t.JMeterThread: Thread started: Users 1-49
2026-05-30 21:46:46,875 INFO o.a.j.t.JMeterThread: Thread started: Users 1-50
2026-05-30 21:46:47,057 INFO o.a.j.t.JMeterThread: Thread started: Users 1-51
2026-05-30 21:46:47,239 INFO o.a.j.t.JMeterThread: Thread started: Users 1-52
2026-05-30 21:46:47,421 INFO o.a.j.t.JMeterThread: Thread started: Users 1-53
2026-05-30 21:46:47,602 INFO o.a.j.t.JMeterThread: Thread started: Users 1-54
2026-05-30 21:46:47,785 INFO o.a.j.t.JMeterThread: Thread started: Users 1-55
2026-05-30 21:47:00,021 INFO o.a.j.r.Summariser: summary +    391 in 00:00:22 =   17.7/s Avg:   921 Min:   707 Max:  2692 Err:     0 (0.00%) Active: 55 Started: 55 Finished: 0
2026-05-30 21:47:30,019 INFO o.a.j.r.Summariser: summary +    600 in 00:00:30 =   20.0/s Avg:   991 Min:   988 Max:   997 Err:     0 (0.00%) Active: 55 Started: 55 Finished: 0
2026-05-30 21:47:30,019 INFO o.a.j.r.Summariser: summary =    991 in 00:00:52 =   19.0/s Avg:   964 Min:   707 Max:  2692 Err:     0 (0.00%)
2026-05-30 21:47:51,266 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-28
2026-05-30 21:47:51,316 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-2
2026-05-30 21:47:51,366 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-50
2026-05-30 21:47:51,416 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-3
2026-05-30 21:47:51,470 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-38
2026-05-30 21:47:51,516 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-51
2026-05-30 21:47:51,567 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-4
2026-05-30 21:47:51,617 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-1
2026-05-30 21:47:51,666 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-29
2026-05-30 21:47:51,717 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-52
2026-05-30 21:47:51,768 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-39
2026-05-30 21:47:51,816 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-22
2026-05-30 21:47:51,868 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-17
2026-05-30 21:47:51,917 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-53
2026-05-30 21:47:51,968 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-18
2026-05-30 21:47:52,016 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-40
2026-05-30 21:47:52,067 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-30
2026-05-30 21:47:52,118 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-54
2026-05-30 21:47:52,167 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-23
2026-05-30 21:47:52,218 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-41
2026-05-30 21:47:52,266 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-19
2026-05-30 21:47:52,316 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-55
2026-05-30 21:47:52,368 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-31
2026-05-30 21:47:52,417 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-20
2026-05-30 21:47:52,468 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-24
2026-05-30 21:47:52,517 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-42
2026-05-30 21:47:52,568 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-5
2026-05-30 21:47:52,617 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-32
2026-05-30 21:47:52,667 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-12
2026-05-30 21:47:52,714 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-43
2026-05-30 21:47:52,769 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-13
2026-05-30 21:47:52,818 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-25
2026-05-30 21:47:52,867 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-44
2026-05-30 21:47:52,916 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-33
2026-05-30 21:47:52,968 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-16
2026-05-30 21:47:53,015 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-10
2026-05-30 21:47:53,015 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-10
2026-05-30 21:47:53,064 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-45
2026-05-30 21:47:53,064 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-45
2026-05-30 21:47:53,116 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-7
2026-05-30 21:47:53,117 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-7
2026-05-30 21:47:53,166 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-34
2026-05-30 21:47:53,167 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-34
2026-05-30 21:47:53,217 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-9
2026-05-30 21:47:53,217 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-9
2026-05-30 21:47:53,268 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-26
2026-05-30 21:47:53,268 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-26
2026-05-30 21:47:53,318 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-46
2026-05-30 21:47:53,318 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-46
2026-05-30 21:47:53,366 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-15
2026-05-30 21:47:53,367 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-15
2026-05-30 21:47:53,417 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-35
2026-05-30 21:47:53,417 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-35
2026-05-30 21:47:53,467 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-8
2026-05-30 21:47:53,467 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-8
2026-05-30 21:47:53,516 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-47
2026-05-30 21:47:53,516 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-47
2026-05-30 21:47:53,567 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-14
2026-05-30 21:47:53,567 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-14
2026-05-30 21:47:53,615 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-6
2026-05-30 21:47:53,615 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-6
2026-05-30 21:47:53,666 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-48
2026-05-30 21:47:53,667 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-48
2026-05-30 21:47:53,718 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-36
2026-05-30 21:47:53,718 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-36
2026-05-30 21:47:53,764 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-27
2026-05-30 21:47:53,764 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-27
2026-05-30 21:47:53,817 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-11
2026-05-30 21:47:53,817 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-11
2026-05-30 21:47:53,868 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-49
2026-05-30 21:47:53,868 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-49
2026-05-30 21:47:53,917 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-21
2026-05-30 21:47:53,917 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-21
2026-05-30 21:47:53,968 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-37
2026-05-30 21:47:53,968 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-37
2026-05-30 21:47:53,968 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-30 21:47:53,969 INFO o.a.j.r.Summariser: summary +    479 in 00:00:24 =   20.0/s Avg:   992 Min:   990 Max:   998 Err:     0 (0.00%) Active: 0 Started: 55 Finished: 55
2026-05-30 21:47:53,970 INFO o.a.j.r.Summariser: summary =   1470 in 00:01:16 =   19.3/s Avg:   973 Min:   707 Max:  2692 Err:     0 (0.00%)