tpo/lab4/results/stress/jmeter_tp800.log
2026-05-30 21:41:56,157 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-05-30 21:41:56,182 INFO o.a.j.JMeter: Loading user properties from: /home/studs/s413122/apache-jmeter-5.6.3/bin/user.properties
2026-05-30 21:41:56,183 INFO o.a.j.JMeter: Loading system properties from: /home/studs/s413122/apache-jmeter-5.6.3/bin/system.properties
2026-05-30 21:41:56,183 INFO o.a.j.JMeter: Setting JMeter property: config=2
2026-05-30 21:41:56,183 INFO o.a.j.JMeter: Setting JMeter property: throughput=800
2026-05-30 21:41:56,183 INFO o.a.j.JMeter: Setting JMeter property: threads=35
2026-05-30 21:41:56,183 INFO o.a.j.JMeter: Setting JMeter property: duration=75
2026-05-30 21:41:56,183 INFO o.a.j.JMeter: Setting JMeter property: rampup=10
2026-05-30 21:41:56,191 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-05-30 21:41:56,191 INFO o.a.j.JMeter: Version 5.6.3
2026-05-30 21:41:56,191 INFO o.a.j.JMeter: java.version=17.0.12
2026-05-30 21:41:56,191 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-05-30 21:41:56,191 INFO o.a.j.JMeter: os.name=FreeBSD
2026-05-30 21:41:56,191 INFO o.a.j.JMeter: os.arch=amd64
2026-05-30 21:41:56,192 INFO o.a.j.JMeter: os.version=14.4-STABLE
2026-05-30 21:41:56,192 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-05-30 21:41:56,192 INFO o.a.j.JMeter: java.awt.headless=true
2026-05-30 21:41:56,192 INFO o.a.j.JMeter: Max memory     =2147483648
2026-05-30 21:41:56,192 INFO o.a.j.JMeter: Available Processors =16
2026-05-30 21:41:56,203 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-05-30 21:41:56,203 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-05-30 21:41:56,203 INFO o.a.j.JMeter: JMeterHome=/home/studs/s413122/apache-jmeter-5.6.3
2026-05-30 21:41:56,203 INFO o.a.j.JMeter: user.dir  =/home/studs/s413122/lab4
2026-05-30 21:41:56,203 INFO o.a.j.JMeter: PWD       =/home/studs/s413122/lab4
2026-05-30 21:41:56,212 INFO o.a.j.JMeter: IP: 192.168.10.80 Name: helios.cs.ifmo.ru FullName: helios.cs.ifmo.ru
2026-05-30 21:41:56,227 INFO o.a.j.s.FileServer: Default base='/home/studs/s413122/lab4'
2026-05-30 21:41:56,230 INFO o.a.j.s.FileServer: Set new base='/home/studs/s413122/lab4'
2026-05-30 21:41:56,422 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-05-30 21:41:56,450 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-05-30 21:41:56,453 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-05-30 21:41:56,457 INFO o.a.j.s.SaveService: Loading file: /home/studs/s413122/lab4/load-test.jmx
2026-05-30 21:41:56,523 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:41:56,524 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:41:56,524 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:41:56,524 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-05-30 21:41:56,524 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-05-30 21:41:56,524 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-05-30 21:41:56,562 INFO o.a.j.JMeter: Creating summariser <summary>
2026-05-30 21:41:56,576 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-05-30 21:41:56,577 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-30 21:41:56,577 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-05-30 21:41:56,582 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-05-30 21:41:56,582 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-05-30 21:41:56,643 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-cmd-2.3.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:41:56,647 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-manager-1.10.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:41:56,738 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-cmn-jmeter-0.8.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:41:56,764 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-graphs-vs-2.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:41:56,766 INFO o.a.j.r.ClassFinder: Will scan jar /home/studs/s413122/apache-jmeter-5.6.3/lib/ext/jmeter-plugins-graphs-basic-2.0.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-05-30 21:41:56,784 INFO o.a.j.JMeter: Running test (1780166516784)
2026-05-30 21:41:56,802 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Users
2026-05-30 21:41:56,802 INFO o.a.j.e.StandardJMeterEngine: Starting 35 threads for group Users.
2026-05-30 21:41:56,802 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-05-30 21:41:56,802 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=35 ramp-up=10 delayedStart=false
2026-05-30 21:41:56,808 INFO o.a.j.t.JMeterThread: Thread started: Users 1-1
2026-05-30 21:41:56,829 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-05-30 21:41:56,829 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-05-30 21:41:56,855 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = helios.cs.ifmo.ru
2026-05-30 21:41:56,861 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-05-30 21:41:56,863 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-05-30 21:41:56,863 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-05-30 21:41:56,863 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-05-30 21:41:56,863 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-05-30 21:41:57,091 INFO o.a.j.t.JMeterThread: Thread started: Users 1-2
2026-05-30 21:41:59,350 INFO o.a.j.t.JMeterThread: Thread started: Users 1-4
2026-05-30 21:41:59,349 INFO o.a.j.t.JMeterThread: Thread started: Users 1-3
2026-05-30 21:41:59,349 INFO o.a.j.t.JMeterThread: Thread started: Users 1-9
2026-05-30 21:41:59,349 INFO o.a.j.t.JMeterThread: Thread started: Users 1-6
2026-05-30 21:41:59,349 INFO o.a.j.t.JMeterThread: Thread started: Users 1-8
2026-05-30 21:41:59,350 INFO o.a.j.t.JMeterThread: Thread started: Users 1-7
2026-05-30 21:41:59,350 INFO o.a.j.t.JMeterThread: Thread started: Users 1-5
2026-05-30 21:41:59,378 INFO o.a.j.t.JMeterThread: Thread started: Users 1-10
2026-05-30 21:41:59,663 INFO o.a.j.t.JMeterThread: Thread started: Users 1-11
2026-05-30 21:41:59,949 INFO o.a.j.t.JMeterThread: Thread started: Users 1-12
2026-05-30 21:42:00,061 INFO o.a.j.r.Summariser: summary +      3 in 00:00:03 =    0.9/s Avg:  1803 Min:   706 Max:  2436 Err:     0 (0.00%) Active: 12 Started: 12 Finished: 0
2026-05-30 21:42:00,236 INFO o.a.j.t.JMeterThread: Thread started: Users 1-13
2026-05-30 21:42:00,523 INFO o.a.j.t.JMeterThread: Thread started: Users 1-14
2026-05-30 21:42:00,807 INFO o.a.j.t.JMeterThread: Thread started: Users 1-15
2026-05-30 21:42:01,093 INFO o.a.j.t.JMeterThread: Thread started: Users 1-16
2026-05-30 21:42:01,380 INFO o.a.j.t.JMeterThread: Thread started: Users 1-17
2026-05-30 21:42:01,665 INFO o.a.j.t.JMeterThread: Thread started: Users 1-18
2026-05-30 21:42:01,951 INFO o.a.j.t.JMeterThread: Thread started: Users 1-19
2026-05-30 21:42:02,237 INFO o.a.j.t.JMeterThread: Thread started: Users 1-20
2026-05-30 21:42:02,523 INFO o.a.j.t.JMeterThread: Thread started: Users 1-21
2026-05-30 21:42:02,810 INFO o.a.j.t.JMeterThread: Thread started: Users 1-22
2026-05-30 21:42:03,096 INFO o.a.j.t.JMeterThread: Thread started: Users 1-23
2026-05-30 21:42:03,380 INFO o.a.j.t.JMeterThread: Thread started: Users 1-24
2026-05-30 21:42:03,667 INFO o.a.j.t.JMeterThread: Thread started: Users 1-25
2026-05-30 21:42:03,952 INFO o.a.j.t.JMeterThread: Thread started: Users 1-26
2026-05-30 21:42:04,239 INFO o.a.j.t.JMeterThread: Thread started: Users 1-27
2026-05-30 21:42:04,524 INFO o.a.j.t.JMeterThread: Thread started: Users 1-28
2026-05-30 21:42:04,811 INFO o.a.j.t.JMeterThread: Thread started: Users 1-29
2026-05-30 21:42:05,096 INFO o.a.j.t.JMeterThread: Thread started: Users 1-30
2026-05-30 21:42:05,383 INFO o.a.j.t.JMeterThread: Thread started: Users 1-31
2026-05-30 21:42:05,668 INFO o.a.j.t.JMeterThread: Thread started: Users 1-32
2026-05-30 21:42:05,955 INFO o.a.j.t.JMeterThread: Thread started: Users 1-33
2026-05-30 21:42:06,240 INFO o.a.j.t.JMeterThread: Thread started: Users 1-34
2026-05-30 21:42:06,527 INFO o.a.j.t.JMeterThread: Thread started: Users 1-35
2026-05-30 21:42:30,027 INFO o.a.j.r.Summariser: summary +    409 in 00:00:30 =   13.6/s Avg:   822 Min:   706 Max:   870 Err:     0 (0.00%) Active: 35 Started: 35 Finished: 0
2026-05-30 21:42:30,027 INFO o.a.j.r.Summariser: summary =    412 in 00:00:33 =   12.4/s Avg:   829 Min:   706 Max:  2436 Err:     0 (0.00%)
2026-05-30 21:43:00,026 INFO o.a.j.r.Summariser: summary +    400 in 00:00:30 =   13.3/s Avg:   849 Min:   849 Max:   857 Err:     0 (0.00%) Active: 35 Started: 35 Finished: 0
2026-05-30 21:43:00,026 INFO o.a.j.r.Summariser: summary =    812 in 00:01:03 =   12.8/s Avg:   839 Min:   706 Max:  2436 Err:     0 (0.00%)
2026-05-30 21:43:10,078 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-25
2026-05-30 21:43:10,150 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-33
2026-05-30 21:43:10,227 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-8
2026-05-30 21:43:10,301 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-15
2026-05-30 21:43:10,376 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-5
2026-05-30 21:43:10,450 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-34
2026-05-30 21:43:10,523 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-26
2026-05-30 21:43:10,601 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-4
2026-05-30 21:43:10,676 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-20
2026-05-30 21:43:10,750 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-35
2026-05-30 21:43:10,825 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-9
2026-05-30 21:43:10,901 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-27
2026-05-30 21:43:10,976 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-6
2026-05-30 21:43:11,051 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-16
2026-05-30 21:43:11,128 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-21
2026-05-30 21:43:11,200 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-1
2026-05-30 21:43:11,276 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-28
2026-05-30 21:43:11,351 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-2
2026-05-30 21:43:11,426 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-22
2026-05-30 21:43:11,500 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-29
2026-05-30 21:43:11,576 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-10
2026-05-30 21:43:11,650 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-17
2026-05-30 21:43:11,724 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-13
2026-05-30 21:43:11,801 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-30
2026-05-30 21:43:11,875 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-23
2026-05-30 21:43:11,875 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-23
2026-05-30 21:43:11,951 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-11
2026-05-30 21:43:11,951 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-11
2026-05-30 21:43:12,026 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-14
2026-05-30 21:43:12,026 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-14
2026-05-30 21:43:12,101 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-31
2026-05-30 21:43:12,101 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-31
2026-05-30 21:43:12,177 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-18
2026-05-30 21:43:12,177 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-18
2026-05-30 21:43:12,251 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-12
2026-05-30 21:43:12,251 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-12
2026-05-30 21:43:12,325 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-24
2026-05-30 21:43:12,325 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-24
2026-05-30 21:43:12,400 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-32
2026-05-30 21:43:12,401 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-32
2026-05-30 21:43:12,474 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-7
2026-05-30 21:43:12,475 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-7
2026-05-30 21:43:12,550 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-3
2026-05-30 21:43:12,551 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-3
2026-05-30 21:43:12,626 INFO o.a.j.t.JMeterThread: Stopping because end time detected by thread: Users 1-19
2026-05-30 21:43:12,626 INFO o.a.j.t.JMeterThread: Thread finished: Users 1-19
2026-05-30 21:43:12,626 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-05-30 21:43:12,627 INFO o.a.j.r.Summariser: summary +    168 in 00:00:13 =   13.3/s Avg:   849 Min:   849 Max:   855 Err:     0 (0.00%) Active: 0 Started: 35 Finished: 35
2026-05-30 21:43:12,628 INFO o.a.j.r.Summariser: summary =    980 in 00:01:16 =   12.9/s Avg:   841 Min:   706 Max:  2436 Err:     0 (0.00%)